/*
Завдання 1. Створіть програму, яка обчислює факторіал натурального числа n, яке користувач введе з клавіатури.*/

/*

let n=+prompt('Enter number');
let rez=1;

for(let i=1; i<=n; i++){
	rez*=i;
	
}
	document.write(rez)
*/

/*
Завдання 2. Створіть програму, що виводить на екран всі чотиризначні числа послідовності 1000 1003 1006 1009 1012 1015.*/



// for(let i=1000;i<=9999;i=i+3){
// 	document.write(i +'; ')
// }




/*
Завдання 3.Створіть програму, що виводить на екран перші 55 елементів послідовності 1 3 5 7 9 11 13 15 17 ....*/
/*

for(let i=1, n=1; i<=55; n+=2, i++){
	document.write(i + '# '+ n +'<br> ')
}

*/

/*
Завдання 4.Створіть програму, що виводить на екран всі невід'ємні елементи послідовності 90 85 80 75 70 65 60 ....*/

/*

for(let i=90; i>0; i=i-5){
	document.write(i +'  ');
}

*/

/*
Завдання 5.Створіть програму, що виводить на екран перші 20 елементів послідовності 2 4 8 16 32 64 128 ....*/

/*

for(let i=1, n=2;i<=20;n*=2, i++){
	document.write('№'+i+'->'+n +'<br> ')
}
*/

/*
Завдання 6.Виведіть на екран всі числа в послідовності 2a-1, де a1 = 2, які менше 10000.*/

/*

for(let a=2; a<=10000; a=2*a-1){
document.write(a+' ')

}

*/

/*
Завдання 7. Виведіть на екран всі двозначні члени послідовності 2a+200, де a1 = -166.*/

/*

for(let a=-166; a<100;a=2*a+200){
	(a>-100)?document.write(a+' '):null;
}

*/

/*
Завдання 8.Написати програму що обчислює піднесення до степеня. 1 промпт вводиться число в 2 степінь. Умови: Степінь може бути додатній, від'ємний або 0. Обрахувати всі можливі варіанти циклом for. Задачу бажано виконати використовуючи 1 цикл!
a^b = a*a b раз;
a^-b= 1/a^b;
a^0 = 1;*/
/*

let a=+prompt('enter number');
let b=+prompt('enter value');
let result=1;
let c=b;
(b<0)?c=-b:'';
for(i=0;i<c;i++){
	result*=a;
}
(b<0)?result=1/result:''

document.write(result);

*/